import { ITask } from "../models/models";

/*деталь задачи*/
const TaskDetailsPage: React.FC = () => {
  return (
    <div className="container">
      <h1 className="title">Задача 1</h1>
      <div className="task">
        <h3>Название</h3>
        <p>Дата создания: </p>
        <p>Приоритет: </p>
        <p className="marks">
          Отметки:
        </p>
        <p>Описание: опоппопоопопоппоовлв лыдлыадлала алаллалыдыд лалылжжвл ыжвжадададда жфжфжжфжкщк алжлпддЛПЖ Жааладаааж фжжжЖЖКЖЛЛЛ ЖжЖООАОАЛЖж жЛЛАЛЖАЛОПФЖлпооп оодпдпопо опоппопоопопоппоовлв лыдлыадлала алаллалыдыд лалылжжвл ыжвжадададда жфжфжжфжкщк алжлпддЛПЖ Жааладаааж фжжжЖЖКЖЛЛЛ ЖжЖООАОАЛЖж жЛЛАЛЖАЛОПФЖлпооп оодпдпопо опоппопоопопоппоовлв лыдлыадлала алаллалыдыд лалылжжвл ыжвжадададда жфжфжжфжкщк алжлпддЛПЖ Жааладаааж фжжжЖЖКЖЛЛЛ ЖжЖООАОАЛЖж жЛЛАЛЖАЛОПФЖлпооп оодпдпопо опоппопоопопоппоовлв лыдлыадлала алаллалыдыд лалылжжвл ыжвжадададда жфжфжжфжкщк алжлпддЛПЖ Жааладаааж фжжжЖЖКЖЛЛЛ ЖжЖООАОАЛЖж жЛЛАЛЖАЛОПФЖлпооп оодпдпопо  </p>
        <div className="buttons-container">
          <button className="btn btn-delete">Удалить</button>
          <button className="btn">Редактировать</button>
        </div>
      </div>

    </div>
  )
}

export default TaskDetailsPage;